АлогистикТест2/src/Documents/алк_ЗаказПокупателя/алк_ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗаказПокупателя</name>
  <registerRecords>InformationRegister.алк_АссортиментныеГруппыПредставление</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗаказыПокупателей</registerRecords>
  <registerRecords>InformationRegister.алк_ИД_ГруппХарактеристик</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗаказыПокупателейПоОбъемнымГруппам</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОтгрузкиПоЗаказам</registerRecords>
  <registerRecords>InformationRegister.алк_ОбъемныеГруппыПредставление</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НоименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеАссортиментМассивом</name>
    <comment>УДАЛИТЬ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.алк_УсловияПоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МассивыНоменклатуры</name>
    <attributes>
      <name>Толщина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокШирина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапасыАссортимент</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Припуск</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемныеГруппы</name>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отпад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАддендум</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрТолщина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрШирина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрДлина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрСорт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвтоПредставление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрКатегорияПЭО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрНомераКатегорияПЭО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Припуск</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПакетыИсторияЗаказов/алк_ПакетыИсторияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыИсторияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_АналитикаНоменклатурыПЭО/алк_АналитикаНоменклатурыПЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_АналитикаНоменклатурыПЭО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>ТипНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_ТипНоменклатурыПЭО</types>
    </type>
  </resources>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область СобытияЭлементовФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьНаименование();
	Объект.НоименованиеПолное = СформироватьНаименованиеПолное();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьНаименование();	
	Объект.НоименованиеПолное = СформироватьНаименованиеПолное();
	
КонецПроцедуры

&НаКлиенте
Процедура ДопНомерПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьНаименование();
	Объект.НоименованиеПолное = СформироватьНаименованиеПолное();
	
КонецПроцедуры

&НаКлиенте
Процедура ДопДатаПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьНаименование();
	Объект.НоименованиеПолное = СформироватьНаименованиеПолное();
	
КонецПроцедуры

////////////////////////////////////// события тп "ПредставлениеМассива" ///////////////////////////////////////

&НаКлиенте
Процедура ПредставлениеМассиваСписокДлинаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПредставлениеМассива.ТекущиеДанные;
	Толщина = ТекущиеДанные.Толщина;
	
	СписокДляВыбора = СписокДлинаНачалоВыбораНаСервере(Толщина);
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Сечения.");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМассиваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока ИЛИ Элемент.ТекущиеДанные.КлючСвязи = 0 Тогда
		
		МассивКлючей = Новый Массив;
		
		Для каждого стрПМ Из ПредставлениеМассива Цикл
			
			МассивКлючей.Добавить(стрПМ.КлючСвязи);
			
		КонецЦикла; 
		
		МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
		
		Если МаксЭлемент <> Неопределено Тогда
			
			Элемент.ТекущиеДанные.КлючСвязи = МаксЭлемент.Значение + 1;
			
		Иначе
			
			Элемент.ТекущиеДанные.КлючСвязи = 1;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМассиваОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры

/////////////////////////////////////

&НаКлиенте
Процедура ОбъемныеГруппы1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъемныеГруппы1ПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


//////////////////////////////////// события тп "ОбъемныеГруппы" ////////////////////////////////////////////////

&НаКлиенте
Процедура ОбъемныеГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока ИЛИ Элемент.ТекущиеДанные.ИдентификаторГруппы = 0 Тогда
		
		МассивКлючей = Новый Массив;
		
		Для каждого стрПМ Из Объект.ОбъемныеГруппы Цикл 			
			МассивКлючей.Добавить(стрПМ.ИдентификаторГруппы); 			
		КонецЦикла; 
		
		МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
		
		Если МаксЭлемент <> Неопределено Тогда			
			Элемент.ТекущиеДанные.ИдентификаторГруппы = МаксЭлемент.Значение + 1; 			
		Иначе                                                                    			
			Элемент.ТекущиеДанные.ИдентификаторГруппы = 1;               			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НоваяСтрока Тогда		
		Элемент.ТекущиеДанные.АвтоПредставление = Истина; 		
	КонецЕсли; 	
	
	Если НоваяСтрока И Элементы.Запасы.ТекущиеДанные <> Неопределено Тогда 		
		
		Элемент.ТекущиеДанные.КлючСвязи = Элементы.Запасы.ТекущиеДанные.КлючСвязи;
		
		Если Объект.КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Щепа") Тогда  			
			Элемент.ТекущиеДанные.Объем 	= Элементы.Запасы.ТекущиеДанные.Количество;                                  		
			СтрНоменклатура = Элементы.Запасы.ТекущиеДанные.Номенклатура;
			Порода = ПолучитьПороду(Элементы.Запасы.ТекущиеДанные.Характеристика);		
			Элемент.ТекущиеДанные.ПредставлениеАддендум	 = "" +  СтрНоменклатура + " (" + Порода + ")";		
		КонецЕсли;

		УстановитьОтборТаблицы(Элемент);
		
	Иначе                                		
		ОтменаРедактирования = Истина;  		
	КонецЕсли;

	
КонецПроцедуры


&НаКлиенте
Процедура ОбъемныеГруппыстрТолщинаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда		
		Сообщить("Требуется указать категорию номенклатуры!"); 
		Элементы.ОбъемныеГруппы.ТекущиеДанные.стрТолщина = "";
		Возврат;	
	КонецЕсли; 
	
	Если Найти(Строка(Объект.КатегорияНоменклатуры), "Пиломатериал") Тогда 		
		Пиломатериал = Истина;	
	Иначе
		Пиломатериал = Ложь;		
	КонецЕсли;
	
	Если Пиломатериал И Элементы.ОбъемныеГруппы.ТекущиеДанные.АвтоПредставление Тогда
		СтрокаТабличнойЧасти = Элементы.ОбъемныеГруппы.ТекущиеДанные;
		СтрокаТабличнойЧасти.ПредставлениеАддендум = СформироватьНаименованиеАддендум(СтрокаТабличнойЧасти);	
	КонецЕсли; 
	
	ПроверкаФорматаЗаполнения(СтрокаТабличнойЧасти.стрТолщина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемныеГруппыстрДлинаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда		
		Сообщить("Требуется указать категорию номенклатуры!"); 
		Элементы.ОбъемныеГруппы.ТекущиеДанные.стрДлина = "";
		Возврат;	
	КонецЕсли;
	
	Если Найти(Строка(Объект.КатегорияНоменклатуры), "Пиломатериал") Тогда 		
		Пиломатериал = Истина;	
	Иначе
		Пиломатериал = Ложь;		
	КонецЕсли;
	
	Если Пиломатериал И Элементы.ОбъемныеГруппы.ТекущиеДанные.АвтоПредставление Тогда
		СтрокаТабличнойЧасти = Элементы.ОбъемныеГруппы.ТекущиеДанные;
		СтрокаТабличнойЧасти.ПредставлениеАддендум = СформироватьНаименованиеАддендум(СтрокаТабличнойЧасти);
	КонецЕсли;
	
	ПроверкаФорматаЗаполнения(СтрокаТабличнойЧасти.стрДлина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемныеГруппыстрШиринаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда		
		Сообщить("Требуется указать категорию номенклатуры!"); 
		Элементы.ОбъемныеГруппы.ТекущиеДанные.стрШирина = "";
		Возврат;	
	КонецЕсли;
	
	Если Найти(Строка(Объект.КатегорияНоменклатуры), "Пиломатериал") Тогда 		
		Пиломатериал = Истина;	
	Иначе
		Пиломатериал = Ложь;		
	КонецЕсли;
	
	Если Пиломатериал И Элементы.ОбъемныеГруппы.ТекущиеДанные.АвтоПредставление Тогда
		СтрокаТабличнойЧасти = Элементы.ОбъемныеГруппы.ТекущиеДанные;
		СтрокаТабличнойЧасти.ПредставлениеАддендум = СформироватьНаименованиеАддендум(СтрокаТабличнойЧасти);
	КонецЕсли; 
	
	ПроверкаФорматаЗаполнения(СтрокаТабличнойЧасти.стрШирина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемныеГруппыПередУдалением(Элемент, Отказ)
	
	КлючКУдалению = Элемент.ТекущиеДанные.ИдентификаторГруппы;
	
	Для каждого стрПМ Из ПредставлениеМассива Цикл
		
		Если стрПМ.идГруппы = КлючКУдалению Тогда
			стрПМ.идГруппы = 0;	
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

//////////////////////////////////// события тп "ОбъемныеГруппы1" ////////////////////////////////////////////////

&НаКлиенте
Процедура ОбъемныеГруппы1ПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;
		
	Иначе
		
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемныеГруппы1Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитОГ = ЭтаФорма["Объект"].ОбъемныеГруппы;
	
	ИДПриемник = Строка;
	Приемник = ?(ИДПриемник = Неопределено, Неопределено, РеквизитОГ.НайтиПоИдентификатору(ИДПриемник));
	
	Если Приемник <> Неопределено Тогда
		
		Если Приемник.Свойство("ИдентификаторГруппы") Тогда
			
			Для каждого стрМассивНоменклатуры Из ПараметрыПеретаскивания.Значение Цикл
				
				стрМассивНоменклатуры.идГруппы = Приемник.ИдентификаторГруппы;
				
			КонецЦикла; 	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


//////////////////////////////////// работа с Деревом

&НаКлиенте
Процедура ОбновитьДеревоМассива()
	
	//ЭлементыДерева = ДеревоМассива.ПолучитьЭлементы();
	//
	//Для каждого стрПМассива Из ПредставлениеМассива Цикл
	//	
	//	НоваяСтрока = ЭлементыДерева.Добавить();
	//	НоваяСтрока.Узел1 = стрПМассива.идГруппы;
	//	
	//КонецЦикла; 
	
КонецПроцедуры //ОбновитьДеревоМассива

&НаКлиенте
Процедура ДеревоМассиваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти 


#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДеревоМассива();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
КонецПроцедуры


#КонецОбласти 


#Область КомандыФормы

&НаКлиенте
Процедура СформироватьАссортимент(Команда)	
	
	Объект.ЗапасыАссортимент.Очистить();
	
	Если Найти(Строка(Объект.КатегорияНоменклатуры), "Пиломатериал") Тогда 		
		Пиломатериал = Истина;	
	Иначе
		Пиломатериал = Ложь;		
	КонецЕсли;
	
	Если Не Пиломатериал Тогда 	
		СформироватьАссортиментНаСервереЩепа();		
	Иначе
		СформироватьАссортиментНаСервере(Команда.Имя = "СформироватьАссортиментАктуальные");				
	КонецЕсли; 	
	
	Элементы.СтраницыВложАссортимент.ТекущаяСтраница = Элементы.СтраницаАссортиментСтроки;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАссортиментНаСервереЩепа()
	 		
	Для каждого стрПредставления Из ПредставлениеМассива Цикл		
		
		Если ЗначениеЗаполнено(стрПредставления.Порода) Тогда
			
			НаименованиеСтроки = "" + стрПредставления.Порода.СокращенноеНаименование + ";"; 		
			НаименованиеСтрокиАнгл = "" + стрПредставления.Порода.НаименованиеАнгл + ";";  		
			НаименованиеСтроки = НаименованиеСтроки + " // " + НаименованиеСтрокиАнгл;
			
			Для каждого СтрОбъемныеГруппы Из Объект.ОбъемныеГруппы Цикл	// ищем ключ			
				Если стрПредставления.идГруппы = СтрОбъемныеГруппы.ИдентификаторГруппы  Тогда   
					КлючСвязи = СтрОбъемныеГруппы.КлючСвязи;
					
					Для каждого СтрЗапасы Из Объект.Запасы Цикл  // получаем характеристику по ключу строки
						Если СтрЗапасы.КлючСвязи = КлючСвязи Тогда							
							Характеристика = СтрЗапасы.Характеристика; 							
							Прервать;
						КонецЕсли;		
					КонецЦикла;
					
					Прервать;
				КонецЕсли;		
			КонецЦикла; 
			
			Если ЗначениеЗаполнено(Характеристика) Тогда
							
				НоваяСтрока = Объект.ЗапасыАссортимент.Добавить();
				НоваяСтрока.Номенклатура = Характеристика.Владелец;
				НоваяСтрока.Характеристика = Характеристика;
				НоваяСтрока.КлючСвязи = КлючСвязи;
				НоваяСтрока.ПредставлениеСтроки = НаименованиеСтроки;
				
				НоваяСтрока.ИдентификаторГруппы = стрПредставления.идГруппы;  														
				
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАссортиментНаСервере(ТолькоАктуальныеХарактериатики = Ложь)
	
	Если ТолькоАктуальныеХарактериатики Тогда    // список характеристик по уже созданным пакетам
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПакетыИсторияЗаказовСрезПоследних.СерийныйНомер
		|ПОМЕСТИТЬ ВТ_ПакетыЗаказа
		|ИЗ
		|	РегистрСведений.алк_ПакетыИсторияЗаказов.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК алк_ПакетыИсторияЗаказовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|			,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ВТ_ПакетыЗаказа.СерийныйНомер
		|				ИЗ
		|					ВТ_ПакетыЗаказа КАК ВТ_ПакетыЗаказа)) КАК алк_ПараметрыПакетовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ПараметрыХарактеристик.Сорт,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ПараметрыХарактеристик.Сечение,
		|	алк_ПараметрыХарактеристик.Влажность
		|ИЗ
		|	ВТ_Характеристики КАК ВТ_Характеристики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО ВТ_Характеристики.Характеристика = алк_ПараметрыХарактеристик.Характеристика";
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", Объект.Ссылка);
		
		АктуальныеХарактеристики = Запрос.Выполнить().Выгрузить(); 	
		
	КонецЕсли; 
	
	ТаблицаСвойствИЗначений = Новый ТаблицаЗначений;
	ТаблицаСвойствИЗначений.Колонки.Добавить("Свойство");
	ТаблицаСвойствИЗначений.Колонки.Добавить("Значение");
	
	пвхПорода    = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
	пвхСорт      = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт);
	пвхДлина     = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина);
	пвхСечение   = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение);
	пвхВлажность = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность);
	
	Для каждого стрПредставления Из ПредставлениеМассива Цикл
		
		Сорта = "";
		СортаАнгл = "";
		Для каждого стрСорта Из стрПредставления.СписокСорта Цикл
			Сорта = Сорта + ?(Сорта = "", "", ",") + стрСорта.Значение.Наименование;
			СортаАнгл = СортаАнгл + ?(СортаАнгл = "", "", ",") + стрСорта.Значение.НаименовАнгл;  
		КонецЦикла;
		
		Сечения = Строка(стрПредставления.Толщина) + "Х";
		Поехали = Истина;
		Для каждого стрСечения Из стрПредставления.СписокШирина Цикл
			//Сечения = Сечения + ?(Сечения = "", "", ",") + стрСечения.Значение.Наименование;
			Сечения = Сечения + ?(Поехали, "", ",") + Строка(стрСечения.Значение.ШиринаММ);
			Поехали = Ложь;
		КонецЦикла; 
		
		НаименованиеСтроки = "" + стрПредставления.Порода.СокращенноеНаименование + " " + стрПредставления.Длина.Наименование +";"+
		Сорта + " (" + Сечения + ")" + стрПредставления.Влажность.Наименование;
		
		НаименованиеСтрокиАнгл = "" + стрПредставления.Порода.НаименованиеАнгл + " " + стрПредставления.Длина.Наименование +";"+
		СортаАнгл + " (" + Сечения + ")" + стрПредставления.Влажность.Наименование;
				
		НаименованиеСтроки = НаименованиеСтроки + " // " + НаименованиеСтрокиАнгл;
		
		Если ЗначениеЗаполнено(стрПредставления.Порода) Тогда
			Если ТолькоАктуальныеХарактериатики Тогда
				Если АктуальныеХарактеристики.Найти(стрПредставления.Порода, "Порода") = Неопределено Тогда										
					Продолжить; 																											
				КонецЕсли;
			КонецЕсли;
			
			
			Для каждого стрСорт Из стрПредставления.СписокСорта Цикл
				Если ТолькоАктуальныеХарактериатики Тогда
					Если АктуальныеХарактеристики.Найти(стрСорт.Значение, "Сорт") = Неопределено Тогда										
						Продолжить; 																											
					КонецЕсли;
				КонецЕсли;
				
				
				Если ЗначениеЗаполнено(стрПредставления.Длина) Тогда
					Если ТолькоАктуальныеХарактериатики Тогда
						Если АктуальныеХарактеристики.Найти(стрПредставления.Длина, "Длина") = Неопределено Тогда										
							Продолжить; 																											
						КонецЕсли;
					КонецЕсли;
					
					
					Для каждого стрСечение Из стрПредставления.СписокШирина Цикл
						Если ТолькоАктуальныеХарактериатики Тогда
							Если АктуальныеХарактеристики.Найти(стрСечение.Значение, "Сечение") = Неопределено Тогда										
								Продолжить; 																											
							КонецЕсли;
						КонецЕсли;
						
						
						Если ЗначениеЗаполнено(стрПредставления.Влажность) Тогда
							Если ТолькоАктуальныеХарактериатики Тогда
								Если АктуальныеХарактеристики.Найти(стрПредставления.Влажность, "Влажность") = Неопределено Тогда										
									Продолжить; 																											
								КонецЕсли;
							КонецЕсли;
							
							
							НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
							НоваяСтрокаСвойств.Свойство = пвхПорода;
							НоваяСтрокаСвойств.Значение = стрПредставления.Порода;
							
							НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
							НоваяСтрокаСвойств.Свойство = пвхСорт;
							НоваяСтрокаСвойств.Значение = стрСорт.Значение;
							
							НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
							НоваяСтрокаСвойств.Свойство = пвхДлина;
							НоваяСтрокаСвойств.Значение = стрПредставления.Длина;
							
							НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
							НоваяСтрокаСвойств.Свойство = пвхСечение;
							НоваяСтрокаСвойств.Значение = стрСечение.Значение;
							
							НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
							НоваяСтрокаСвойств.Свойство = пвхВлажность;
							НоваяСтрокаСвойств.Значение = стрПредставления.Влажность;
							
							Характеристика = АлгоритмыСвойстваИХарактеристики.ПолучитьХарактеристикуПоПараметрам(стрПредставления.Номенклатура, ТаблицаСвойствИЗначений);
							
							Если Не ЗначениеЗаполнено(Характеристика) Тогда
								
								Характеристика = АлгоритмыСвойстваИХарактеристики.СоздатьХарактеристикуПоНаборуСвойств(стрПредставления.Номенклатура, ТаблицаСвойствИЗначений);
								
								Если ЗначениеЗаполнено(Характеристика) Тогда
									Сообщить("Создана характеристика: " + Характеристика);
								Иначе
									Сообщить("Не найдена характеристика по параметрам: " +  стрПредставления.Номенклатура + ", " + стрПредставления.Порода 
									+ ", " + стрСорт.Значение + ", " + стрПредставления.Длина + ", " + стрСечение.Значение + ", " + стрПредставления.Влажность + ";");									
								КонецЕсли;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(Характеристика) Тогда
								
								Если ТолькоАктуальныеХарактериатики Тогда									
									Если АктуальныеХарактеристики.Найти(Характеристика, "Характеристика") = Неопределено Тогда
										ТаблицаСвойствИЗначений.Очистить();
										Продолжить; 																											
									КонецЕсли;  					
								КонецЕсли;							
								
								НоваяСтрока = Объект.ЗапасыАссортимент.Добавить();
								НоваяСтрока.Номенклатура = Характеристика.Владелец;
								НоваяСтрока.Характеристика = Характеристика;
								НоваяСтрока.КлючСвязи = стрПредставления.КлючСвязи;
								НоваяСтрока.ПредставлениеСтроки = НаименованиеСтроки;
								
								НоваяСтрока.ИдентификаторГруппы = стрПредставления.идГруппы; 
								НоваяСтрока.Цена 				= стрПредставления.Цена; 
								НоваяСтрока.Припуск 			= стрПредставления.Припуск; 
								
							КонецЕсли; 
							
							ТаблицаСвойствИЗначений.Очистить();
							
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЦикла; 
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЦикла; 
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	//РфпОбщегоНазначенияКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПиФ

&НаСервере
Функция СформироватьНаименованиеПолное()
	
	Возврат Объект.Договор.НомерДоговора + " от " + Формат(Объект.Договор.ДатаДоговора, "ДЛФ=DD") 
	+ " доп. " + Объект.ДопНомер + " от " + Формат(Объект.ДопДата, "ДЛФ=DD") 
	+ " (" + Объект.Контрагент.Наименование + ")";
	
КонецФункции

&НаСервере
Функция СформироватьНаименование()
	
	Возврат Объект.Договор.НомерДоговора + " доп. " + Объект.ДопНомер;
	
КонецФункции

&НаКлиенте
Функция СформироватьНаименованиеАддендум(СтрокаДанных)
	
	Представление = "Толщина: " + СтрокаДанных.стрТолщина + " мм.; " + "Ширина: " + СтрокаДанных.стрШирина + " мм.; " + "Длина: " + СтрокаДанных.стрДлина + " мм.; " + "Сорт: " + СтрокаДанных.стрСорт; 
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти 

&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЭтоРазделитель Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	Если ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		//СтрокаТабличнойЧасти.НоменклатураСсылка = СтрокаТабличнойЧасти.Номенклатура;
	КонецЕсли;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = 1;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция СписокДлинаНачалоВыбораНаСервере(Толщина)
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмерСечения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РазмерСечения КАК РазмерСечения
	|ГДЕ
	|	РазмерСечения.Владелец = &Владелец
	|	И РазмерСечения.ТолщинаММ = &ТолщинаММ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмерСечения.ШиринаММ";
	
	Запрос.УстановитьПараметр("Владелец", Объект.КатегорияНоменклатуры);
	Запрос.УстановитьПараметр("ТолщинаММ", Толщина);
	//Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции

&НаСервере
Функция СписокСортаНачалоВыбораНаСервере()
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сорта.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сорта КАК Сорта
	|ГДЕ
	|	Сорта.Владелец = &Владелец
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Владелец", Объект.КатегорияНоменклатуры);
	//Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтметкиЭлементов(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора = Неопределено Тогда
		//Сообщить("Отказ от пометк.");
	Иначе
		
		СписокШирина = Элементы.ПредставлениеМассива.ТекущиеДанные.СписокШирина;
		СписокШирина.Очистить();
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокШирина.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементовСорта(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора = Неопределено Тогда
		//Сообщить("Отказ от пометк.");
	Иначе
		
		СписокСорта = Элементы.ПредставлениеМассива.ТекущиеДанные.СписокСорта;
		СписокСорта.Очистить();
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокСорта.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМассиваСписокСортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПредставлениеМассива.ТекущиеДанные;
	
	СписокДляВыбора = СписокСортаНачалоВыбораНаСервере();
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементовСорта", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Сорта.");
	
КонецПроцедуры


Процедура Конец()	
КонецПроцедуры

// обработка выбора сортов и влажности
&НаКлиенте
Процедура ОбъемныеГруппыстрСортНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОбъемныеГруппы.ТекущиеДанные;
	
	СписокДляВыбора = СписокСортаИВлажностиНачалоВыбораНаСервере(ТекущиеДанные.стрСорт);
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементовСортаИВлажности", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Сорта и влажность."); 
		
КонецПроцедуры

&НаСервере
Функция СписокСортаИВлажностиНачалоВыбораНаСервере(СтрокаВыбранных)
	
	МассивВыбранных = РазложитьСтрокуВМассив(СтрокаВыбранных, "; ");
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сорта.Наименование КАК Наименование,
	|	1 КАК Сортировка,
	|	Сорта.Наименование В (&МассивВыбранных) КАК Отметка
	|ИЗ
	|	Справочник.Сорта КАК Сорта
	|ГДЕ
	|	Сорта.Владелец = &Владелец
	|	И НЕ Сорта.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Влажность.Наименование,
	|	2,
	|	Влажность.Наименование В (&МассивВыбранных)
	|ИЗ
	|	Справочник.Влажность КАК Влажность
	|ГДЕ
	|	Влажность.Владелец = &Владелец
	|	И НЕ Влажность.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка,
	|	Наименование";
	
	Запрос.УстановитьПараметр("Владелец", Объект.КатегорияНоменклатуры); 
	Запрос.УстановитьПараметр("МассивВыбранных", МассивВыбранных);
		
	РезультатЗапроса = Запрос.Выполнить(); 	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование,,ВыборкаДетальныеЗаписи.Отметка,);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции 

&НаКлиенте
Процедура ПослеОтметкиЭлементовСортаИВлажности(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора <> Неопределено Тогда
		
		СписокСорта = "";
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокСорта = СписокСорта + Элемент.Значение + "; ";
			КонецЕсли;
		КонецЦикла;
		
		СтрокаТабличнойЧасти = Элементы.ОбъемныеГруппы.ТекущиеДанные;
		СтрокаТабличнойЧасти.стрСорт = СписокСорта; 
				
		Если Найти(Строка(Объект.КатегорияНоменклатуры), "Пиломатериал") Тогда 		
			Пиломатериал = Истина;	
		Иначе
			Пиломатериал = Ложь;		
		КонецЕсли;
		
		Если Пиломатериал И СтрокаТабличнойЧасти.АвтоПредставление Тогда
			СтрокаТабличнойЧасти.ПредставлениеАддендум = СформироватьНаименованиеАддендум(СтрокаТабличнойЧасти);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// обработка категории ПЭО

&НаКлиенте
Процедура ОбъемныеГруппыстрКатегорияПЭОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОбъемныеГруппы.ТекущиеДанные;
	
	СписокДляВыбора = СписокКатегорияПЭОНачалоВыбораНаСервере(ТекущиеДанные.стрНомераКатегорияПЭО);
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементовКатегорииПЭО", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Категория номенклатуры ПЭО.");
	
КонецПроцедуры

&НаСервере
Функция СписокКатегорияПЭОНачалоВыбораНаСервере(СтрокаВыбранных)
	
	МассивВыбранных = РазложитьСтрокуВМассив(СтрокаВыбранных, ";");
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_КатегорияНоменклатурыПЭО.Ссылка КАК Ссылка,
	|	алк_КатегорияНоменклатурыПЭО.Наименование,
	|	алк_КатегорияНоменклатурыПЭО.Код,
	|	алк_КатегорияНоменклатурыПЭО.Код В (&МассивВыбранных) КАК Отметка
	|ИЗ
	|	Справочник.алк_КатегорияНоменклатурыПЭО КАК алк_КатегорияНоменклатурыПЭО
	|ГДЕ
	|	НЕ алк_КатегорияНоменклатурыПЭО.ПометкаУдаления";
				
	запрос.УстановитьПараметр("МассивВыбранных",МассивВыбранных);
	
	РезультатЗапроса = Запрос.Выполнить(); 	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Код, ВыборкаДетальныеЗаписи.Наименование,ВыборкаДетальныеЗаписи.Отметка,);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции 

&НаКлиенте
Процедура ПослеОтметкиЭлементовКатегорииПЭО(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора <> Неопределено Тогда
		
		СписокКатегорияПЭО = "";
		СписокНомераКатегорияПЭО = "";
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокКатегорияПЭО = СписокКатегорияПЭО + Элемент.Представление + "; ";
				СписокНомераКатегорияПЭО = СписокНомераКатегорияПЭО + Элемент.Значение + ";"; 
			КонецЕсли;
		КонецЦикла;
		
		СтрокаТабличнойЧасти = Элементы.ОбъемныеГруппы.ТекущиеДанные;
		СтрокаТабличнойЧасти.стрКатегорияПЭО = СписокКатегорияПЭО;   
		СтрокаТабличнойЧасти.стрНомераКатегорияПЭО = СписокНомераКатегорияПЭО;
					
	КонецЕсли;
	
КонецПроцедуры




// Формирование массива 
&НаКлиенте
Процедура СформироватьМассив(Команда)
	     	
	СписокДляВыбора = СписокПородыВыбораНаСервере();
	Оповещение = Новый ОписаниеОповещения("ПослеВыборвПороды", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Требуется выбрать породу:");
	
КонецПроцедуры

&НаСервереБезКонтекста
// проверка заполнения
Процедура ПроверкаФорматаЗаполнения(Стр)

	// "30-209" "30/45/209" "209"  - пример ожидаемых даных, ищем латиницу и кирилицу и все символы что между 
	// ними в таблице юникода, цифры до латиницы 
	
	Стр = СтрЗаменить(Стр, " ", ""); 
	
	НачалоИнтервала = "";
	КонецИнтервала = "";
	
	МассивСтрок = Новый Массив;
	
	Если Найти(Стр, "-") Тогда      // интервал		
		ПоложениеРазделителя = Найти(Стр, "-");		
		НачалоИнтервала = Сред(Стр, 1, ПоложениеРазделителя - 1);
		КонецИнтервала = Сред(Стр, ПоложениеРазделителя + 1); 		
	ИначеЕсли Найти(Стр, "/") Тогда  // перечень		
		МассивСтрок = РазложитьСтрокуВМассив(Стр, "/");
	Иначе  // конкретное значение
		МассивСтрок.Добавить(Стр);
	КонецЕсли;	

	МассивСтрок.Добавить(НачалоИнтервала);
	МассивСтрок.Добавить(КонецИнтервала);
	
	КС = Новый КвалификаторыСтроки(300);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Строка", ОписаниеТиповС);
	
	// Создадим пустые строки таблицы   
	Для Н = 1 По МассивСтрок.Количество() Цикл
		ТЗ.Добавить();
	КонецЦикла;
	
	ТЗ.ЗагрузитьКолонку(МассивСтрок, "Строка");
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Строка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Строка
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Строка ПОДОБНО &Шаблон";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТЗ);
	Запрос.УстановитьПараметр("Шаблон", "%[A-яЁё.,;:?!№=+]%");  // A - из латиницы
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда                                                                                  	
		Сообщить("Неверный формат! Возмоные варианты заполнения: интервал (30 - 209); перечень (30/45/209); значение (30).");	
	КонецЕсли; 	   	

КонецПроцедуры
 


&НаСервереБезКонтекста
Функция СписокПородыВыбораНаСервере()
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Породы.Ссылка
	|ИЗ
	|	Справочник.Породы КАК Породы";
		
	РезультатЗапроса = Запрос.Выполнить(); 	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции 

&НаКлиенте
Процедура ПослеВыборвПороды(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	МассивПороды = Новый Массив;
	
	Для каждого Элемент Из СписокДляВыбора Цикл
		Если Элемент.Пометка Тогда
			МассивПороды.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла; 
		
	КатегорияНоменклатуры = Объект.КатегорияНоменклатуры; //ПолучитьКатегориюНоменклатуры(СтрНоменклатура);
	
	// нужно получить список толшины и ширины, длин, влажности. 
	
	ПредставлениеМассива.Очистить();
	
	Если Найти(Строка(Объект.КатегорияНоменклатуры), "Пиломатериал") Тогда 		
		Пиломатериал = Истина;	
	Иначе
		Пиломатериал = Ложь;		
	КонецЕсли;
	
	Если Не Пиломатериал  Тогда
		
		//Порода = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(Объект.Запасы[0].Характеристика).Порода;
		
		Для каждого Стр Из  Объект.ОбъемныеГруппы Цикл
			
			Для каждого ЭлЗапасы Из Объект.Запасы Цикл			
				Если Стр.КлючСвязи = ЭлЗапасы.КлючСвязи Тогда 				
					СтрНоменклатура = ЭлЗапасы.Номенклатура;
					Порода = ПолучитьПороду(ЭлЗапасы.Характеристика);  				
					Прервать;    			
				КонецЕсли;     			
			КонецЦикла;  
			
			Для каждого СтрПороды Из МассивПороды Цикл  				
				Если СтрПороды <> Порода И ЗначениеЗаполнено(Порода) Тогда
					Продолжить;			
				КонецЕсли;
				
				НаваяСтрока =  ПредставлениеМассива.Добавить();
				
				НаваяСтрока.идГруппы 		= Стр.ИдентификаторГруппы;
				НаваяСтрока.Порода 			= СтрПороды;  
				НаваяСтрока.Номенклатура 	= СтрНоменклатура;
								
			КонецЦикла; 
		КонецЦикла;
		
	Иначе
		
		Для каждого Стр Из  Объект.ОбъемныеГруппы Цикл
			
			Для каждого ЭлЗапасы Из Объект.Запасы Цикл			
				Если Стр.КлючСвязи = ЭлЗапасы.КлючСвязи Тогда 				
					СтрНоменклатура = ЭлЗапасы.Номенклатура;
					Порода = ПолучитьПороду(ЭлЗапасы.Характеристика);  				
					Прервать;    			
				КонецЕсли;     			
			КонецЦикла; 
			
			МассивДлин 		= ПолучитьМассивДлинИзСтроки(Стр.стрДлина, КатегорияНоменклатуры);
			МассивТолщин 	= ПолучитьМассивТолщин(Стр.стрТолщина, Стр.стрШирина, КатегорияНоменклатуры);
			МассивСеченией 	= ПолучитьМассивСечений(Стр.стрТолщина, Стр.стрШирина, КатегорияНоменклатуры);
			МассивСортов	= ПолучитьМассивСортов(Стр.стрСорт, КатегорияНоменклатуры);
			МассивВлажности	= ПолучитьМассивВлажности(Стр.стрСорт, КатегорияНоменклатуры);
			
			Для каждого СтрПороды Из МассивПороды Цикл 
				
				Если СтрПороды <> Порода И ЗначениеЗаполнено(Порода) Тогда
					Продолжить;			
				КонецЕсли;
				
				Для каждого СтрДлина Из МассивДлин Цикл 				
					Для каждого СтрТолщины Из МассивТолщин Цикл					
						Для каждого СтрВлажности Из МассивВлажности Цикл 
							
							СеченияПоТолщине = Новый Массив; 						
							Для каждого СтрСечения Из МассивСеченией Цикл 					
								Если Найти(СтрСечения, "" + Формат(СтрТолщины, "ЧДЦ=; ЧГ=") + " Х") Тогда
									СеченияПоТолщине.Добавить(СтрСечения);				
								КонецЕсли;			
							КонецЦикла;
							
							НаваяСтрока =  ПредставлениеМассива.Добавить();
							
							НаваяСтрока.идГруппы 		= Стр.ИдентификаторГруппы;
							НаваяСтрока.Порода 			= СтрПороды;  
							НаваяСтрока.Номенклатура 	= СтрНоменклатура;
							НаваяСтрока.Длина			= СтрДлина;
							НаваяСтрока.Толщина			= СтрТолщины;						 
							НаваяСтрока.Влажность		= СтрВлажности;
							НаваяСтрока.Цена			= Стр.Цена;
							НаваяСтрока.Припуск			= Стр.Припуск;

							
							НаваяСтрока.СписокШирина.ЗагрузитьЗначения(СеченияПоТолщине);
							НаваяСтрока.СписокСорта.ЗагрузитьЗначения(МассивСортов);
							
							
						КонецЦикла;	
					КонецЦикла; 				
				КонецЦикла; 			
			КонецЦикла;		
		КонецЦикла; 
		
	КонецЕсли; 

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКатегориюНоменклатуры(СтрНоменклатура) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.КатегорияНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтрНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КатегорияНоменклатуры;
		
КонецФункции // 	КатегорияНоменклатуры = ПолучитьКатегориюНоменклатуры(СтрНоменклатура);¶()
    
// функция парсит сторку и возвращает массив ссылок
&НаСервереБезКонтекста
Функция ПолучитьМассивДлинИзСтроки(стрДлина, Владелец)

	стрДлина = СтрЗаменить(стрДлина, " ", ""); 
	
	МассивДлин 		= Новый Массив;
	МассивСтрок		= Новый Массив;
	НачалоИнтервала	= 0;
	КонецИнтервала	= 0;
	
	Если Найти(стрДлина, "-") Тогда      // интервал		
		ПоложениеРазделителя = Найти(стрДлина, "-");		
		НачалоИнтервала = Сред(стрДлина, 1, ПоложениеРазделителя - 1);
		КонецИнтервала = Сред(стрДлина, ПоложениеРазделителя + 1);		
	ИначеЕсли Найти(стрДлина, "/") Тогда  // перечень		
		МассивСтрок = РазложитьСтрокуВМассив(стрДлина, "/");
	Иначе  // конкретное значение
		МассивСтрок.Добавить(стрДлина);
	КонецЕсли;	
	
	
	ПреобразоватьМассивСтрокВмассивЧисел(МассивСтрок);
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Длины.Ссылка
	|ИЗ
	|	Справочник.Длины КАК Длины
	|ГДЕ
	|	(Длины.ДлинаММ В (&ДлинаММ)
	|			ИЛИ Длины.ДлинаММ >= &ДлинаММ1
	|				И Длины.ДлинаММ <= &ДлинаММ2)
	|	И НЕ Длины.ПометкаУдаления
	|	И Длины.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", 	Владелец);
	Запрос.УстановитьПараметр("ДлинаММ", 	МассивСтрок);
	Запрос.УстановитьПараметр("ДлинаММ1", 	Число(НачалоИнтервала));
	Запрос.УстановитьПараметр("ДлинаММ2", 	Число(КонецИнтервала));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДлин.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;        
	
	Возврат МассивДлин;

КонецФункции // ПолучитьМассивДлинИзСтроки()

&НаСервереБезКонтекста
Функция ПолучитьМассивТолщин(стрТолщина, стрШирина, Владелец)

	стрТолщина 	= СтрЗаменить(стрТолщина, " ", "");
	стрШирина 	= СтрЗаменить(стрШирина, " ", "");
	
	МассивТолщин		= Новый Массив;
	МассивСтрокТ		= Новый Массив;
	МассивСтрокШ		= Новый Массив;
	НачалоИнтервалаТ	= 0;
	КонецИнтервалаТ 	= 0;
	НачалоИнтервалаШ	= 0;
	КонецИнтервалаШ 	= 0;  	
	
	Если Найти(стрТолщина, "-") Тогда      // интервал		
		ПоложениеРазделителя = Найти(стрТолщина, "-");		
		НачалоИнтервалаТ	 = Сред(стрТолщина, 1, ПоложениеРазделителя - 1);
		КонецИнтервалаТ 	= Сред(стрТолщина, ПоложениеРазделителя + 1);		
	ИначеЕсли Найти(стрТолщина, "/") Тогда  // перечень 		
		МассивСтрокТ = РазложитьСтрокуВМассив(стрТолщина, "/"); 
	Иначе                                                  	
		МассивСтрокТ.Добавить(стрТолщина);
	КонецЕсли;
	
	ПреобразоватьМассивСтрокВмассивЧисел(МассивСтрокТ);

	Если Найти(стрШирина, "-") Тогда      // интервал		
		ПоложениеРазделителя = Найти(стрШирина, "-");		
		НачалоИнтервалаШ	 = Сред(стрШирина, 1, ПоложениеРазделителя - 1);
		КонецИнтервалаШ 	= Сред(стрШирина, ПоложениеРазделителя + 1);		
	ИначеЕсли Найти(стрШирина, "/") Тогда  // перечень 		
		МассивСтрокШ = РазложитьСтрокуВМассив(стрШирина, "/"); 
	Иначе                                                  	
		МассивСтрокШ.Добавить(стрШирина);
	КонецЕсли;
	
	ПреобразоватьМассивСтрокВмассивЧисел(МассивСтрокШ); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазмерСечения.ТолщинаММ
		|ИЗ
		|	Справочник.РазмерСечения КАК РазмерСечения
		|ГДЕ
		|	(РазмерСечения.ШиринаММ В (&ШиринаММ)
		|			ИЛИ РазмерСечения.ШиринаММ >= &ШиринаММ1
		|				И РазмерСечения.ШиринаММ <= &ШиринаММ2)
		|	И (РазмерСечения.ТолщинаММ В (&ТолщинаММ)
		|			ИЛИ РазмерСечения.ТолщинаММ >= &ТолщинаММ1
		|				И РазмерСечения.ТолщинаММ <= &ТолщинаММ2)
		|	И НЕ РазмерСечения.ПометкаУдаления
		|	И РазмерСечения.ТолщинаММ <> 0
		|	И РазмерСечения.ШиринаММ <> 0
		|	И РазмерСечения.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", 	Владелец);
	Запрос.УстановитьПараметр("ТолщинаММ", 	МассивСтрокТ);
	Запрос.УстановитьПараметр("ТолщинаММ1", Число(НачалоИнтервалаТ));
	Запрос.УстановитьПараметр("ТолщинаММ2", Число(КонецИнтервалаТ));
	Запрос.УстановитьПараметр("ШиринаММ", 	МассивСтрокШ);
	Запрос.УстановитьПараметр("ШиринаММ1", 	Число(НачалоИнтервалаШ));
	Запрос.УстановитьПараметр("ШиринаММ2", 	Число(КонецИнтервалаШ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивТолщин.Добавить(ВыборкаДетальныеЗаписи.ТолщинаММ);
	КонецЦикла;

	Возврат МассивТолщин;
	
КонецФункции // ПолучитьМассивСечений()

&НаСервереБезКонтекста
Функция ПолучитьМассивСечений(стрТолщина, стрШирина, Владелец)

	стрТолщина 	= СтрЗаменить(стрТолщина, " ", "");
	стрШирина 	= СтрЗаменить(стрШирина, " ", "");
	
	МассивСечений 		= Новый Массив;
	МассивСтрокТ		= Новый Массив;
	МассивСтрокШ		= Новый Массив;
	НачалоИнтервалаТ	= 0;
	КонецИнтервалаТ 	= 0;
	НачалоИнтервалаШ	= 0;
	КонецИнтервалаШ 	= 0;  	
	
	Если Найти(стрТолщина, "-") Тогда      // интервал		
		ПоложениеРазделителя = Найти(стрТолщина, "-");		
		НачалоИнтервалаТ	 = Сред(стрТолщина, 1, ПоложениеРазделителя - 1);
		КонецИнтервалаТ 	= Сред(стрТолщина, ПоложениеРазделителя + 1);		
	ИначеЕсли Найти(стрТолщина, "/") Тогда  // перечень 		
		МассивСтрокТ = РазложитьСтрокуВМассив(стрТолщина, "/"); 
	Иначе                                                  	
		МассивСтрокТ.Добавить(стрТолщина);
	КонецЕсли;
	
	ПреобразоватьМассивСтрокВмассивЧисел(МассивСтрокТ);
	
	Если Найти(стрШирина, "-") Тогда      // интервал		
		ПоложениеРазделителя = Найти(стрШирина, "-");		
		НачалоИнтервалаШ	 = Сред(стрШирина, 1, ПоложениеРазделителя - 1);
		КонецИнтервалаШ 	= Сред(стрШирина, ПоложениеРазделителя + 1);		
	ИначеЕсли Найти(стрШирина, "/") Тогда  // перечень 		
		МассивСтрокШ = РазложитьСтрокуВМассив(стрШирина, "/"); 
	Иначе                                                  	
		МассивСтрокШ.Добавить(стрШирина);
	КонецЕсли;
	
	ПреобразоватьМассивСтрокВмассивЧисел(МассивСтрокШ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазмерСечения.Ссылка
		|ИЗ
		|	Справочник.РазмерСечения КАК РазмерСечения
		|ГДЕ
		|	(РазмерСечения.ШиринаММ В (&ШиринаММ)
		|			ИЛИ РазмерСечения.ШиринаММ >= &ШиринаММ1
		|				И РазмерСечения.ШиринаММ <= &ШиринаММ2)
		|	И (РазмерСечения.ТолщинаММ В (&ТолщинаММ)
		|			ИЛИ РазмерСечения.ТолщинаММ >= &ТолщинаММ1
		|				И РазмерСечения.ТолщинаММ <= &ТолщинаММ2)
		|	И НЕ РазмерСечения.ПометкаУдаления
		|	И РазмерСечения.ШиринаММ <> 0
		|	И РазмерСечения.ТолщинаММ <> 0
		|	И РазмерСечения.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", 	Владелец);  
	Запрос.УстановитьПараметр("ТолщинаММ", 	МассивСтрокТ);
	Запрос.УстановитьПараметр("ТолщинаММ1", Число(НачалоИнтервалаТ));
	Запрос.УстановитьПараметр("ТолщинаММ2", Число(КонецИнтервалаТ));
	Запрос.УстановитьПараметр("ШиринаММ", 	МассивСтрокШ);
	Запрос.УстановитьПараметр("ШиринаММ1", 	Число(НачалоИнтервалаШ));
	Запрос.УстановитьПараметр("ШиринаММ2", 	Число(КонецИнтервалаШ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСечений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

	Возврат МассивСечений;
	
КонецФункции // ПолучитьМассивСечений()

&НаСервереБезКонтекста
Функция ПолучитьМассивСортов(стрСорт, КатегорияНоменклатуры)
	
	МассивСтрСорт =  РазложитьСтрокуВМассив(стрСорт, "; ");
	
	МассивСорт = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сорта.Ссылка
	|ИЗ
	|	Справочник.Сорта КАК Сорта
	|ГДЕ
	|	Сорта.Наименование В(&Наименование)
	|	И НЕ Сорта.ПометкаУдаления
	|	И Сорта.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Наименование", 	МассивСтрСорт);
	Запрос.УстановитьПараметр("Владелец", 		КатегорияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСорт.Добавить(ВыборкаДетальныеЗаписи.Ссылка); 		
	КонецЦикла;
	
	Возврат МассивСорт;	

КонецФункции // ПолучитьМассивСортов()

&НаСервереБезКонтекста
Функция ПолучитьМассивВлажности(стрВлажность, КатегорияНоменклатуры)
	
	МассивСтрВлажность =  РазложитьСтрокуВМассив(стрВлажность, "; ");
	
	МассивВлажность = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Влажность.Ссылка
	|ИЗ
	|	Справочник.Влажность КАК Влажность
	|ГДЕ
	|	Влажность.Наименование В(&Наименование)
	|	И НЕ Влажность.ПометкаУдаления
	|	И Влажность.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Наименование", 	МассивСтрВлажность);
	Запрос.УстановитьПараметр("Владелец", 		КатегорияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивВлажность.Добавить(ВыборкаДетальныеЗаписи.Ссылка); 		
	КонецЦикла;
	
	Возврат МассивВлажность;	

КонецФункции // ПолучитьМассивВлажности()
  
&НаСервереБезКонтекста
// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - строка, которую необходимо разложить на подстроки. 
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//       
Функция РазложитьСтрокуВМассив(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции    

&НаСервереБезКонтекста
Процедура ПреобразоватьМассивСтрокВмассивЧисел(МассивСтрок)

	Для й = 0 По МассивСтрок.Количество() - 1 Цикл		
		Если ЗначениеЗаполнено(МассивСтрок[й]) Тогда 		
			МассивСтрок.Установить(й, Число(МассивСтрок[й]));	
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры


&НаКлиенте
Процедура ОбъемныеГруппыОбъемПриИзменении(Элемент)
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПороду(Характеристика)

	Возврат АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(Характеристика).Порода;	

КонецФункции // ПолучитьПороду()

&НаКлиенте
Процедура ЗапасыПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборТаблицы(Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТаблицы(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено И Не ПоказыватьВсеОбъемныеГруппы Тогда		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("КлючСвязи", Элемент.ТекущиеДанные.КлючСвязи);   		
		Элементы.ОбъемныеГруппы.ОтборСтрок = СтруктураОтбора;		
	Иначе                                                   		
		Элементы.ОбъемныеГруппы.ОтборСтрок = Неопределено; 		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьОтборТаблицы

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	КлючКУдалению = Элемент.ТекущиеДанные.КлючСвязи;
	
	Индекс = Объект.ОбъемныеГруппы.Количество() - 1; 
	
	Пока Индекс >= 0 Цикл 
		
		Если Объект.ОбъемныеГруппы[Индекс].КлючСвязи = КлючКУдалению Тогда 
			Объект.ОбъемныеГруппы.Удалить(Индекс); 
		КонецЕсли; 
		
		Индекс = Индекс - 1; 
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		МассивКлючей = Новый Массив;
		
		Для каждого стрЗапасы Из Объект.Запасы Цикл 			
			МассивКлючей.Добавить(стрЗапасы.КлючСвязи);			
		КонецЦикла; 
		
		МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
		
		Если МаксЭлемент <> Неопределено Тогда 			
			Элемент.ТекущиеДанные.КлючСвязи = МаксЭлемент.Значение + 1;			
		Иначе                                                      			
			Элемент.ТекущиеДанные.КлючСвязи = 1;                			
		КонецЕсли; 
		
	КонецЕсли;	

КонецПроцедуры

 
&НаКлиенте
Процедура ОбъемныеГруппыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Запасы.ТекущиеДанные = Неопределено Тогда 		
		Отказ = Истина;                                   		
	КонецЕсли;       	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВсеОбъемныеГруппы(Команда)
	
	ПоказыватьВсеОбъемныеГруппы = Не ПоказыватьВсеОбъемныеГруппы;
	
	УстановитьОтборТаблицы(Элементы.Запасы);
	
	УстановитьЦветКнопки();
	
КонецПроцедуры

Процедура УстановитьЦветКнопки()
	
	Если ПоказыватьВсеОбъемныеГруппы Тогда
		Элементы.кПоказыватьВсеОбъемныеГруппы.ЦветФона = ЦветаСтиля.ЦветФонаУдачнойОтправки;
	Иначе 
	    Элементы.кПоказыватьВсеОбъемныеГруппы.ЦветФона = Новый Цвет();
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемныеГруппыПриИзменении(Элемент)
	
	Если Элементы.ОбъемныеГруппы.ТекущиеДанные = Неопределено Тогда    // обработа удаления
		Возврат;	
	КонецЕсли;
	
	Если Найти(Строка(Объект.КатегорияНоменклатуры), "Пиломатериал") Тогда 		
		Пиломатериал = Истина;	
	Иначе
		Пиломатериал = Ложь;		
	КонецЕсли;
	
	Если Не Пиломатериал и Элементы.ОбъемныеГруппы.ТекущиеДанные.АвтоПредставление Тогда 	
		
		Для каждого ЭлЗапасы Из Объект.Запасы Цикл			
			Если Элемент.ТекущиеДанные.КлючСвязи = ЭлЗапасы.КлючСвязи Тогда 				
				СтрНоменклатура = ЭлЗапасы.Номенклатура;
			    Порода = ПолучитьПороду(ЭлЗапасы.Характеристика);  				
				Прервать;    			
			КонецЕсли;     			
		КонецЦикла;  	
		
		Элементы.ОбъемныеГруппы.ТекущиеДанные.ПредставлениеАддендум	 = "" +  СтрНоменклатура + " (" + Порода + ")"; 
		
	КонецЕсли; 
	
	
КонецПроцедуры


&НаСервере
Процедура ПроверитьАналитикуНаСервере()
	
	МассивЗапасыАссортимент = Объект.ЗапасыАссортимент.Выгрузить(,"Характеристика");
	                               	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АналитикаНоменклатурыПЭОСрезПоследних.Характеристика
		|ИЗ
		|	РегистрСведений.алк_АналитикаНоменклатурыПЭО.СрезПоследних(, Характеристика В (&Характеристики)) КАК алк_АналитикаНоменклатурыПЭОСрезПоследних";
	
	Запрос.УстановитьПараметр("Характеристики", МассивЗапасыАссортимент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	АналитикаОтсутствует = Ложь;
	
	Для каждого ИскомаяХарактеристика Из МассивЗапасыАссортимент Цикл
		
		Если РезультатЗапроса.Найти(ИскомаяХарактеристика.Характеристика) = Неопределено Тогда
			
			Если Не АналитикаОтсутствует Тогда   // выводим один раз для удобства копирования
				Сообщить("Не установлена аналитика ПЭО для характеристики: ");		
			КонецЕсли; 
						
			АналитикаОтсутствует = Истина;
			
			Сообщить("" + ИскомаяХарактеристика.Характеристика);
			
		КонецЕсли;
		
				
	КонецЦикла;	
	
	Если Не АналитикаОтсутствует Тогда
		Сообщить("Проверка аналитики завершена успешно!");		
	КонецЕсли;

		
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьАналитику(Команда)
	ПроверитьАналитикуНаСервере();
КонецПроцедуры
